In [1]:
ex1.csv
a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

命令语法不正确。

NameError: name 'a' is not defined

In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [2]:
#加载文件
!type examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv('examples\ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('examples\ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
!type examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
pd.read_csv('examples\ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('examples\ex2.csv',names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names = ['a','b','c','d','message']
pd.read_csv('examples\ex2.csv',names=names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
!type examples\csv_mindex.csv

key1,key2,value1,value2,
one,a,1,2,
one,b,3,4,
one,c,5,6,
one,d,7,8,
two,a,9,10,
two,b,11,12,
two,c,13,14,
two,d,15,16,

In [10]:
parsed = pd.read_csv('examples\csv_mindex.csv',index_col =['key1','key2'])
parsed

           value1  value2  Unnamed: 4
key1 key2
one  a          1       2         NaN
     b          3       4         NaN
     c          5       6         NaN
     d          7       8         NaN
two  a          9      10         NaN
     b         11      12         NaN
     c         13      14         NaN
     d         15      16         NaN

In [14]:
df = pd.read_csv('examples\csv_mindex.csv',skiprows = [0,2])
df

   one  a   1   2  Unnamed: 4
0  one  c   5   6         NaN
1  one  d   7   8         NaN
2  two  a   9  10         NaN
3  two  b  11  12         NaN
4  two  c  13  14         NaN
5  two  d  15  16         NaN

In [15]:
pd.read_csv('examples\ex2.csv',names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
df = pd.read_csv('examples\ex2.csv',skiprows = [3])
df

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [23]:
df = pd.read_csv('examples\ex3.csv')
df

    one  two  three   four  key
0     1    7       4     3   A1
1     2    8       6     5   A2
2     3    4       1     0   A3
3     4    3       5     7   A4
4     5    9       8     4   A5
5     6   10      11     5   A6
6     7   11      12     6   A7
7     8   12      13     7   A8
8     9   13      14     8   A9
9    10   14      15     9  A10
10   11   15      16    10  A11
11   12   16      17    11  A12
12   13   17      18    12  A13
13   14   18      19    13  A14
14   15   19      20    14  A15
15   16   20      21    15  A16
16   17   21      22    16  A17
17   18   22      23    17  A18
18   19   23      24    18  A19
19   20   24      25    19  A20

In [24]:
pd.options.display.max_rows = 10
df = pd.read_csv('examples\ex3.csv')
df

    one  two  three   four  key
0     1    7       4     3   A1
1     2    8       6     5   A2
2     3    4       1     0   A3
3     4    3       5     7   A4
4     5    9       8     4   A5
..  ...  ...     ...   ...  ...
15   16   20      21    15  A16
16   17   21      22    16  A17
17   18   22      23    17  A18
18   19   23      24    18  A19
19   20   24      25    19  A20

[20 rows x 5 columns]

In [34]:
df = pd.read_csv('examples\ex3.csv',nrows = 5)
df

   one  two  three   four key
0    1    7       4     3  A1
1    2    8       6     5  A2
2    3    4       1     0  A3
3    4    3       5     7  A4
4    5    9       8     4  A5

In [35]:
df = pd.read_csv('examples\ex3.csv',chunksize=2)
df

In [27]:
df

In [36]:
tot = pd.Series([])
for piece in df:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)

tot.sort_values(ascending = False)
tot

A1     1.0
A10    1.0
A11    1.0
A12    1.0
A13    1.0
      ...
A5     1.0
A6     1.0
A7     1.0
A8     1.0
A9     1.0
Length: 20, dtype: float64

In [37]:
tot[:5]

A1     1.0
A10    1.0
A11    1.0
A12    1.0
A13    1.0
dtype: float64

In [41]:
data = pd.read_csv('examples\ex4.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [40]:
!type examples\ex4.csv

something,a,b,c,d,message
one,1,2,3,4,
two,5,6,,8,world
three,9,10,11,12,foo

In [42]:
data.to_csv('examples\out1.csv')

In [43]:
!type examples\out1.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [44]:
import sys

In [48]:
data.to_csv(sys.stdout,sep='|',na_rep = 'NULL',index=False,columns = ['a','b','c'])

a|b|c
1|2|3.0
5|6|NULL
9|10|11.0

In [53]:
dates = pd.date_range('1/1/2000',periods = 7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [54]:
ts = pd.Series(np.arange(7),index = dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [55]:
ts.to_csv('examples\out2.csv')

In [58]:
!type examples\out2.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

data = pd.read_csv('examples\ex5.csv')

In [59]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [60]:
data = pd.read_csv('examples\ex5.csv')
data

   "a"  "b"  "c"
0  "1"  "2"  "3"
1  "1"  "2"  "3"

In [68]:
import csv

In [85]:
f = open('examples\ex7.csv')
reader = csv.reader(f)
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [74]:
!type examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [76]:
with open('examples\ex7.csv')as f:
    lines = list(csv.reader(f))

In [77]:
header,values = lines[0],lines[1:]

In [79]:
data_dict = {h:v for h,v in zip (header,zip(*values))}

In [80]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [86]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [88]:
reader = csv.reader(f,dialect = my_dialect)

In [89]:
reader

In [90]:
reader = csv.reader(f,delimiter='|')
reader

In [93]:
with open('examples\ex8.csv','w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [94]:
!type examples\ex8.csv

one;two;three
1;2;3
4;5;6
7;8;9

In [95]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}"""

In [96]:
#json字符串转换为python
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [97]:
#将python对象转回json
adjson = json.dumps(result)

In [98]:
#传入DATAFRAME构造函数
siblings = pd.DataFrame(result['siblings'],columns = ['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [101]:
! type examples\ex9.csv

[{"name": "Scott", "age": 30},
{"name": "Katie", "age": 38},
{"name": "Tom", "age": 20}]

In [102]:
data = pd.read_json('examples\ex9.csv')
data

   age   name
0   30  Scott
1   38  Katie
2   20    Tom

In [103]:
print(data.to_json())

{"age":{"0":30,"1":38,"2":20},"name":{"0":"Scott","1":"Katie","2":"Tom"}}

In [104]:
print(data.to_json(orient = 'records'))

[{"age":30,"name":"Scott"},{"age":38,"name":"Katie"},{"age":20,"name":"Tom"}]

In [107]:
#读取Excel文件
xlsx = pd.ExcelFile('examples\ex10.xlsx')
frame = pd.read_excel(xlsx,'Sheet1')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [108]:
#写入Excel文件
writer = pd.ExcelWriter('examples\ex11.xlsx')
frame.to_excel(writer,'Sheet1')
writer.save()

In [109]:
frame2 = pd.read_excel('examples\ex11.xlsx','Sheet1')
frame2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [110]:
#从SQL中读取数据
import sqlite3
query = """
       CREATE TABLE test
       (a VARCHAR(20),b VARCHAR(20),
        c REAL,       d INTEGER
        );"""

In [111]:
con = sqlite3.connect('mydata.sqlite')
con.execute(query)

In [112]:
con.commit()

In [113]:
data = [('Atl','Geo',1.25,6),
        ('Tal','Flo',2.6,3),
        ('Sac','Cal',1.7,5)]
stmt = "INSERT INTO test VALUES(?,?,?,?)"
con.executemany(stmt,data)

In [114]:
con.commit()

In [115]:
cursor = con.execute('select * from test')
rows =cursor.fetchall()
rows

[('Atl', 'Geo', 1.25, 6), ('Tal', 'Flo', 2.6, 3), ('Sac', 'Cal', 1.7, 5)]

In [116]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [118]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

     a    b     c  d
0  Atl  Geo  1.25  6
1  Tal  Flo  2.60  3
2  Sac  Cal  1.70  5

In [119]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
print(pd.read_sql('select * from test', db))

     a    b     c  d
0  Atl  Geo  1.25  6
1  Tal  Flo  2.60  3
2  Sac  Cal  1.70  5